# Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Import the dataset names as drinks.csv

In [3]:
df=pd.read_csv("drinks.csv")

# Explore the data useing .head() or .info() method

In [9]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

# Which continent drinks more beer on average?

In [17]:
df.pivot_table(index='continent',values='beer_servings', aggfunc='mean')

           beer_servings
continent
AF             61.471698
AS             37.045455
EU            193.777778
OC             89.687500
SA            175.083333

# For a continent like EU, print the statistics for wine consumption.<br> hint : use .describe method on wine consumption column

In [15]:
df[df['continent']=='EU'].groupby('continent')['wine_servings'].agg(['sum','mean','count','min','max'])
#df.groupby('continent')['wine_servings'].agg(['sum','mean','count','min','max']).loc[['EU']]

            sum        mean  count  min  max
continent
EU         6400  142.222222     45    0  370

# Print the mean alcohol consumption per country for every column

In [13]:
#df.set_index('country')[['beer_servings','spirit_servings','wine_servings']].mean(axis=1)
df.groupby('country').mean(numeric_only=True)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0.0,0.0,0.0,0.0
Albania,89.0,132.0,54.0,4.9
Algeria,25.0,0.0,14.0,0.7
Andorra,245.0,138.0,312.0,12.4
Angola,217.0,57.0,45.0,5.9
...,...,...,...,...
Venezuela,333.0,100.0,3.0,7.7
Vietnam,111.0,2.0,1.0,2.0
Yemen,6.0,0.0,0.0,0.1
Zambia,32.0,19.0,4.0,2.5
Zimbabwe,64.0,18.0,4.0,4.7

# Print the median alcohol consumption per country for every column

In [19]:
df.groupby('country').median(numeric_only=True)
#df.set_index('country')[['beer_servings','spirit_servings','wine_servings']].median(axis=1)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0.0,0.0,0.0,0.0
Albania,89.0,132.0,54.0,4.9
Algeria,25.0,0.0,14.0,0.7
Andorra,245.0,138.0,312.0,12.4
Angola,217.0,57.0,45.0,5.9
...,...,...,...,...
Venezuela,333.0,100.0,3.0,7.7
Vietnam,111.0,2.0,1.0,2.0
Yemen,6.0,0.0,0.0,0.1
Zambia,32.0,19.0,4.0,2.5
Zimbabwe,64.0,18.0,4.0,4.7

# Print the mean, min and max values for spirit consumption.

In [25]:
df['spirit_servings'].agg(['mean','min','max'])

mean     80.994819
min       0.000000
max     438.000000
Name: spirit_servings, dtype: float64

# Import the dataset named as regiment.csv

In [2]:
df=pd.read_csv("regiment.csv")

# Explore the data useing .head() or .info() method

In [5]:
df.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   regiment       12 non-null     object
 1   company        12 non-null     object
 2   name           12 non-null     object
 3   preTestScore   12 non-null     int64
 4   postTestScore  12 non-null     int64
dtypes: int64(2), object(3)
memory usage: 612.0+ bytes

# What is the mean preTestScore from the regiment Nighthawks?

In [7]:
df[df['regiment']=='Nighthawks'].groupby('regiment')['preTestScore'].mean()

regiment
Nighthawks    15.25
Name: preTestScore, dtype: float64

# What is the sum of postTestScore from the regiment Dragoons?

In [11]:
df[df['regiment']=='Dragoons'].groupby('regiment')['postTestScore'].sum()

regiment
Dragoons    246
Name: postTestScore, dtype: int64

# What is the median of each company's preTestScore?

In [13]:
df.groupby('preTestScore').median(numeric_only=True)

              postTestScore
preTestScore
2                      62.0
3                      70.0
4                      25.0
24                     94.0
31                     57.0

# What is the mean of each company's postTestScore?

In [15]:
df.groupby('postTestScore').mean(numeric_only=True)

               preTestScore
postTestScore
25                      4.0
57                     31.0
62                      2.0
70                      3.0
94                     24.0

# Present the mean preTestScores grouped by regiment and company

In [29]:
df.groupby(['company','regiment']).agg({'preTestScore':'mean'})

                    preTestScore
company regiment
1st     Dragoons             3.5
        Nighthawks          14.0
        Scouts               2.5
2nd     Dragoons            27.5
        Nighthawks          16.5
        Scouts               2.5

# Present the mean preTestScores grouped by regiment and name

In [31]:
df.groupby(['regiment','name']).agg({'preTestScore':'mean'})

                     preTestScore
regiment   name
Dragoons   Cooze              3.0
           Jacon              4.0
           Ryaner            24.0
           Sone              31.0
Nighthawks Ali               31.0
           Jacobson          24.0
           Miller             4.0
           Milner             2.0
Scouts     Ali                3.0
           Piger              3.0
           Riani              2.0
           Sloan              2.0

# Present the mean postTestScores grouped by regiment and company

In [33]:
df.groupby(['company','regiment']).agg({'postTestScore':'mean'})

                    postTestScore
company regiment
1st     Dragoons             47.5
        Nighthawks           59.5
        Scouts               66.0
2nd     Dragoons             75.5
        Nighthawks           59.5
        Scouts               66.0

# Present the mean postTestScores grouped by regiment and name

In [35]:
df.groupby(['regiment','name']).agg({'postTestScore':'mean'})

                     postTestScore
regiment   name
Dragoons   Cooze              70.0
           Jacon              25.0
           Ryaner             94.0
           Sone               57.0
Nighthawks Ali                57.0
           Jacobson           94.0
           Miller             25.0
           Milner             62.0
Scouts     Ali                70.0
           Piger              70.0
           Riani              62.0
           Sloan              62.0

# Group the entire dataframe by regiment and company

In [41]:
df.groupby(['regiment','company'])

# What is the number of observations in each regiment and company

In [45]:
df.groupby(['company','regiment']).size()

company  regiment
1st      Dragoons      2
         Nighthawks    2
         Scouts        2
2nd      Dragoons      2
         Nighthawks    2
         Scouts        2
dtype: int64

# Import the dataset named as Sales.csv

In [49]:
df=pd.read_csv("Sales.csv")

# Explore the data useing .head() or .info() method

In [51]:
df.head()

,Trans Number,Employee,Year,Month,WeekDay,Product,Units,Sales,Location
0,1,Betsy,2018,March,Thursday,lip gloss,45,137.204558,south
1,2,Hallagan,2018,March,Wednesday,foundation,50,152.007303,midwest
2,3,Ashley,2019,February,Friday,lipstick,9,28.719483,midwest
3,4,Hallagan,2020,May,Monday,lip gloss,55,167.075322,west
4,5,Zaret,2018,June,Thursday,lip gloss,43,130.602872,midwest

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1891 entries, 0 to 1890
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Trans Number  1891 non-null   int64
 1   Employee      1891 non-null   object
 2   Year          1891 non-null   int64
 3   Month         1891 non-null   object
 4   WeekDay       1891 non-null   object
 5   Product       1891 non-null   object
 6   Units         1891 non-null   int64
 7   Sales         1891 non-null   float64
 8   Location      1891 non-null   object
dtypes: float64(1), int64(3), object(5)
memory usage: 133.1+ KB

# Using Pivot table show total revenue of every Employee each year

In [57]:
df['revenue']=df['Units']*df['Sales']
df.pivot_table(index="Employee", columns="Year", values="revenue", aggfunc="sum").round(0)

Year         2017      2018      2019      2020
Employee
Ashley    24184.0  572390.0  663056.0  428320.0
Betsy      8225.0  657638.0  543203.0  562814.0
Cici      20212.0  560068.0  573272.0  583846.0
Colleen       NaN  656681.0  448663.0  478366.0
Cristina      NaN  525153.0  501012.0  409717.0
Emilee      177.0  522590.0  612075.0  487271.0
Hallagan  40733.0  668164.0  559324.0  573145.0
Jen           NaN  595731.0  582062.0  721660.0
Zaret     13637.0  535159.0  561799.0  598356.0

# Using pivot table show for each salesperson, the total revenue by products

In [59]:
df['revenue']=df['Units']*df['Sales']
df.pivot_table(index="Employee", columns="Product", values="revenue", aggfunc="sum").round(0)

Product   eye liner  foundation  lip gloss  lipstick   mascara
Employee
Ashley     382408.0    277769.0   395447.0  218959.0  413366.0
Betsy      401418.0    547839.0   300570.0  250947.0  271106.0
Cici       365568.0    396734.0   311717.0  197073.0  466306.0
Colleen    192681.0    450083.0   361352.0  125704.0  453890.0
Cristina   342635.0    290599.0   288847.0  150159.0  363642.0
Emilee     502004.0    340699.0   345649.0  150618.0  283143.0
Hallagan   420530.0    470812.0   351856.0  200959.0  397210.0
Jen        475863.0    358120.0   352365.0  267698.0  445407.0
Zaret      539568.0    411628.0   395756.0  145453.0  216547.0

# Using pivot table show for each Location, the total revenue by products

In [63]:
df['revenue']=df['Units']*df['Sales']
df.pivot_table(index="Product", columns="Location", values="revenue", aggfunc="sum").round(0)

Location         east   midwest      south      west
Product
eye liner   1001547.0  850055.0   876237.0  894836.0
foundation   754347.0  844811.0  1008423.0  936702.0
lip gloss    718906.0  642863.0   873375.0  868414.0
lipstick     358498.0  462639.0   387902.0  498533.0
mascara      811257.0  767078.0   875887.0  856395.0

# Using pivot table show for each Location, the total units by products

In [67]:
df.pivot_table(index="Product", columns="Location", values="Units", aggfunc="sum")

Location    east  midwest  south  west
Product
eye liner   5096     4308   4651  4778
foundation  4126     4139   5559  4739
lip gloss   3928     3458   4668  4689
lipstick    1938     2419   2139  2513
mascara     4178     4101   4630  4480

# Using pivot table show for each products, the total units sold by month

In [77]:
df.pivot_table(index="Month", columns="Product", values="Units", aggfunc="sum")

Product    eye liner  foundation  lip gloss  lipstick  mascara
Month
April           2335        1243       1659       871     1164
August          1429        1300       1553       737     1612
December        1847        1631       1842       717     1661
February         903        1457        815       724     1449
January         2006        1584       1378       795     1141
July            1615        1425       1187       634     1995
June            1561        1352       1554       664     1023
March           1768        1946       1581       806     1309
May             1430        1813       1506       935     1708
November        1005        1886       1247       368     1595
October         1447        1173       1250       839     1513
September       1487        1753       1171       919     1219